{"chunks": ["A young boy makes friends with Anil.\nAnil trusts him completely and employs\nhim. Does the boy betray his trust?\nThe Thief's Story\n2\nREAD AND FIND OUT\n• Who does ‘I’ refer to in this story?\n• What is he “a fairly successful hand” at?\n• What does he get from Anil in return for his work?\nI WAS still a thief when I met Anil. And though only 15, I was an\nexperienced and fairly successful hand.\nAnil was watching a wrestling match when I approached him. He\nwas about 25 — a tall, lean fellow — and he lo", "oked easy-going, kind\nand simple enough for my purpose. I hadn’t had much luck of late and\nthought I might be able to get into the young man’s confidence.\n“You look a bit of a wrestler yourself,” I said. A little flattery helps\nin making friends.\n“So do you,” he replied, which put me off for a moment because at\nthat time I was rather thin.\n“Well,” I said modestly, “I do wrestle a bit.”\n“What’s your name?”\n“Hari Singh,” I lied. I took a new name every month. That kept me\nahead of the police and m", "y former employers.\nAfter this introduction, Anil talked about the well-oiled wrestlers\nwho were grunting, lifting and throwing each other about. I didn’t\nhave much to say. Anil walked away. I followed casually.\n“Hello again,” he said.\nI gave him my most appealing smile. “I want to work for you,” I said.\n“But I can’t pay you.”\nReprint 2025-26\nI thought that over for a minute. Perhaps I had misjudged my man.\nI asked, “Can you feed me?”\n“Can you cook?”\n“I can cook,” I lied again.\n“If you can cook,", " then may be I can feed you.”\nHe took me to his room over the Jumna Sweet Shop and told me I\ncould sleep on the balcony. But the meal I cooked that night must\nhave been terrible because Anil gave it to a stray dog and told me to be\noff. But I just hung around, smiling in my most appealing way, and he\ncouldn’t help laughing.\nLater, he patted me on the head and said never mind, he’d teach\nme to cook. He also taught me to write my name and said he would\nsoon teach me to write whole sentences and to", " add numbers. I was\ngrateful. I knew that once I could write like an educated man there\nwould be no limit to what I could achieve.\nIt was quite pleasant working for Anil. I made the tea in the morning\nand then would take my time buying the day’s supplies, usually making\na profit of about a rupee a day. I think he knew I made a little money\nthis way but he did not seem to mind.\nThe Thief’s Story\n9\nReprint 2025-26\nFootprints without Feet\n10\nAnil made money by fits and starts. He would borrow one w", "eek, lend\nthe next. He kept worrying about his next cheque, but as soon as it\narrived he would go out and celebrate. It seems he wrote for magazines —\na queer way to make a living!\nOne evening he came home with a small bundle of notes, saying he\nhad just sold a book to a publisher. At night, I saw him tuck the money\nunder the mattress.\nI had been working for Anil for almost a month and, apart from\ncheating on the shopping, had not done anything in my line of work. I\nhad every opportunity for doi", "ng so. Anil had given me a key to the door,\nand I could come and go as I pleased. He was the most trusting person\nI had ever met.\nAnd that is why it was so difficult to rob him. It’s easy to rob a\ngreedy man, because he can afford to be robbed; but it’s difficult to rob\na careless man — sometimes he doesn’t even notice he’s been robbed\nand that takes all the pleasure out of the work.\nWell, it’s time I did some real work, I told myself; I’m out of practice.\nAnd if I don’t take the money, he’ll on", "ly waste it on his friends. After\nall, he doesn’t even pay me.\nREAD AND FIND OUT\n• How does the thief think Anil will react to the theft?\n• What does he say about the different reactions of people\nwhen they are  robbed?\n• Does Anil realise that he has been robbed?\nAnil was asleep. A beam of moonlight stepped over the balcony and\nfell on the bed. I sat up on the floor, considering the situation. If I took\nthe money, I could catch the 10.30 Express to Lucknow. Slipping out of\nthe blanket, I crept ", "up to the bed. Anil was sleeping peacefully. His\nface was clear and unlined; even I had more marks on my face, though\nmine were mostly scars.\nMy hand slid under the mattress, searching for the notes. When I\nfound them, I drew them out without a sound. Anil sighed in his sleep\nand turned on his side, towards me. I was startled and quickly crawled\nout of the room.\nWhen I was on the road, I began to run. I had the notes at my waist,\nheld there by the string of my pyjamas. I slowed down to a walk an", "d\ncounted the notes: 600 rupees in fifties! I could live like an oil-rich\nArab for a week or two.\nReprint 2025-26\nThe Thief’s Story 11\nWhen I reached the station I did not stop at the ticket office (I had\nnever bought a ticket in my life) but dashed straight to the platform.\nThe Lucknow Express was just moving out. The train had still to pick\nup speed and I should have been able to jump into one of the carriages,\nbut I hesitated — for some reason I can’t explain — and I lost the\nchance to get aw", "ay.\nWhen the train had gone, I found myself standing alone on the\ndeserted platform. I had no idea where to spend the night. I had no\nfriends, believing that friends were more trouble than help. And I did\nnot want to make anyone curious by staying at one of the small hotels\nnear the station. The only person I knew really well was the man I had\nrobbed. Leaving the station, I walked slowly through the bazaar.\nIn my short career as a thief, I had made a study of men’s faces\nwhen they had lost their", " goods. The greedy man showed fear; the rich\nman showed anger; the poor man showed acceptance. But I knew that\nAnil’s face, when he discovered the theft, would show only a touch of\nsadness. Not for the loss of money, but for the loss of trust.\nI found myself in the maidan and sat down on a bench. The night\nwas chilly — it was early November — and a light drizzle added to my\ndiscomfort. Soon it was raining quite heavily. My shirt and pyjamas\nstuck to my skin, and a cold wind blew the rain across ", "my face.\nReprint 2025-26\nFootprints without Feet\n12\nI went back to the bazaar and sat down in the shelter of the clock\ntower. The clock showed midnight. I felt for the notes. They were damp\nfrom the rain.\nAnil’s money. In the morning he would probably have given me two or\nthree rupees to go to the cinema, but now I had it all. I couldn’t cook his\nmeals, run to the bazaar or learn to write whole sentences any more.\nI had forgotten about them in the excitement of the theft. Whole\nsentences, I knew", ", could one day bring me more than a few hundred\nrupees. It was a simple matter to steal — and sometimes just as simple\nto be caught. But to be a really big man, a clever and respected man,\nwas something else. I  should go back to Anil, I told myself, if only to\nlearn to read and write.\nI hurried back to the room feeling very nervous, for it is much\neasier to steal something than to return it undetected. I opened the\ndoor quietly, then stood in the doorway, in clouded moonlight. Anil\nwas still a", "sleep. I crept to the head of the bed, and my hand came up\nwith the notes. I felt his breath on my hand. I remained still for a\nminute. Then my hand found the edge of the mattress, and slipped\nunder it with the notes.\nI awoke late next morning to find that Anil had already made the\ntea. He stretched out his hand towards me. There was a fifty-rupee\nnote between his fingers. My heart sank. I thought I had been discovered.\n“I made some money yesterday,” he explained. “Now you’ll be paid\nregularly.”", "\nMy spirits rose. But when I took the note, I saw it was still wet from\nthe night’s rain.\n“Today we’ll start writing sentences,” he said.\nHe knew. But neither his lips nor his eyes showed anything. I smiled\nat Anil in my most appealing way. And the smile came by itself, without\nany effort.\nRUSKIN BOND\nGLOSSARY\nflattery: insincere praise\nmodestly: without boasting; in a humble way\ngrunting: making low guttural sounds\nappealing: attractive\nunlined: (here) showing no sign of worry or anxiety\nReprin", "t 2025-26\nThe Thief’s Story 13\n1.\nWhat are Hari Singh’s reactions to the prospect of receiving an\neducation? Do they change over time? (Hint: Compare, for example,\nthe thought: “I knew that once I could write like an educated man\nthere would be no limit to what I could achieve” with these later\nthoughts: “Whole sentences, I knew, could one day bring me more\nthan a few hundred rupees. It was a simple matter to steal — and\nsometimes just as simple to be caught. But to be a really big man,\na clever", " and respected man, was something else.”) What makes\nhim return to Anil?\n2.\nWhy does not Anil hand the thief over to the police? Do you think\nmost people would have done so? In what ways is Anil different\nfrom such employers?\n1.\nDo you think people like Anil and Hari Singh are found only in\nfiction, or are there such people in real life?\n2.\nDo you think it a significant detail in the story that Anil is a\nstruggling writer? Does this explain his behaviour in any way?\n3.\nHave you met anyone like H", "ari Singh?  Can you think and imagine\nthe circumstances that can turn a fifteen-year-old boy into a thief?\n4.\nWhere is the story set? (You can get clues from the names of the\npersons and places mentioned in it.) Which language or languages\nare spoken in these places? Do you think the characters in the\nstory spoke to each other in English?\n• ‘He Said It with Arsenic’ by Ruskin Bond\n• ‘Vanka’ by Anton Chekhov\n• ‘A Scandal in Bohemia’ by Arthur Conan Doyle\nThink about it\nTalk about it\nSuggested rea", "ding\nReprint 2025-26"]}